devdnl/dnx-rtos/src/system/drivers/emi/stm32fx/emi.c
/*==============================================================================
File     emi.c

Author   Daniel Zorychta

Brief    External Memory Interface

         Copyright (C) 2022 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


==============================================================================*/

// TODO Driver is not completed!

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "../emi_ioctl.h"

#if defined(ARCH_stm32f1)
#error No FMC implementation!
#elif defined(ARCH_stm32f4)
#include "stm32f4/stm32f4xx.h"
#include "stm32f4/lib/stm32f4xx_rcc.h"
#elif defined(ARCH_stm32f7)
#include "stm32f7/stm32f7xx.h"
#include "stm32f7/lib/stm32f7xx_ll_rcc.h"
#elif defined(ARCH_stm32h7)
#include "stm32h7/stm32h7xx.h"
#include "stm32h7/lib/stm32h7xx_ll_rcc.h"
#endif

/*==============================================================================
  Local macros
==============================================================================*/
#define SDRAM_CMD__NORMAL                       0x0
#define SDRAM_CMD__CLK_CFG_EN                   0x1
#define SDRAM_CMD__PRECHARGE_ALL                0x2
#define SDRAM_CMD__AUTOREFRESH                  0x3
#define SDRAM_CMD__LOADMODEREG                  0x4
#define SDRAM_CMD__SELFREFRESH                  0x5
#define SDRAM_CMD__POWERDOWN                    0x6

#define SDRAM_MODE_REG_BURST_LENGTH_Pos         0
#define SDRAM_MODE_REG_BURST_LENGTH_1           (0 << SDRAM_MODE_REG_BURST_LENGTH_Pos)
#define SDRAM_MODE_REG_BURST_LENGTH_2           (1 << SDRAM_MODE_REG_BURST_LENGTH_Pos)
#define SDRAM_MODE_REG_BURST_LENGTH_4           (2 << SDRAM_MODE_REG_BURST_LENGTH_Pos)
#define SDRAM_MODE_REG_BURST_LENGTH_8           (3 << SDRAM_MODE_REG_BURST_LENGTH_Pos)
#define SDRAM_MODE_REG_BURST_LENGTH_FULL_PAGE   (7 << SDRAM_MODE_REG_BURST_LENGTH_Pos)

#define SDRAM_MODE_REG_BURST_TYPE_Pos           3
#define SDRAM_MODE_REG_BURST_TYPE_SEQUENTIAL    (0 << SDRAM_MODE_REG_BURST_TYPE_Pos)
#define SDRAM_MODE_REG_BURST_TYPE_INTERLEAVED   (1 << SDRAM_MODE_REG_BURST_TYPE_Pos)

#define SDRAM_MODE_REG_CAS_LATENCY_Pos          4
#define SDRAM_MODE_REG_CAS_LATENCY_1            (1 << SDRAM_MODE_REG_CAS_LATENCY_Pos)
#define SDRAM_MODE_REG_CAS_LATENCY_2            (2 << SDRAM_MODE_REG_CAS_LATENCY_Pos)
#define SDRAM_MODE_REG_CAS_LATENCY_3            (3 << SDRAM_MODE_REG_CAS_LATENCY_Pos)

#define SDRAM_MODE_REG_OPERATING_MODE_Pos       7
#define SDRAM_MODE_REG_OPERATING_MODE_STANDARD  (0 << SDRAM_MODE_REG_OPERATING_MODE_Pos)

#define SDRAM_MODE_REG_WRITE_BURST_MODE_Pos     9
#define SDRAM_MODE_REG_WRITE_BURST_MODE_PROG_LENGTH (0 << SDRAM_MODE_REG_WRITE_BURST_MODE_Pos)
#define SDRAM_MODE_REG_WRITE_BURST_MODE_SINGLE_LOCATION_ACCESS (1 << SDRAM_MODE_REG_WRITE_BURST_MODE_Pos)

#if defined(ARCH_stm32f1)
#error No FMC implementation!
#elif defined(ARCH_stm32f4)
#define FMC_BANK_5_6            FMC_Bank5_6
#define FMC_ENABLE()
#define FMC_SDCRx_NC_Pos        (0U)
#define FMC_SDCRx_NR_Pos        (2U)
#define FMC_SDCRx_MWID_Pos      (4U)
#define FMC_SDCRx_NB_Pos        (6U)
#define FMC_SDCRx_CAS_Pos       (7U)
#define FMC_SDCRx_SDCLK_Pos     (10U)
#define FMC_SDCRx_RBURST_Pos    (12U)
#define FMC_SDCRx_RPIPE_Pos     (13U)
#define FMC_SDTRx_TMRD_Pos      (0U)
#define FMC_SDTRx_TXSR_Pos      (4U)
#define FMC_SDTRx_TRAS_Pos      (8U)
#define FMC_SDTRx_TRC_Pos       (12U)
#define FMC_SDTRx_TWR_Pos       (16U)
#define FMC_SDTRx_TRP_Pos       (20U)
#define FMC_SDTRx_TRCD_Pos      (24U)
#elif defined(ARCH_stm32f7)
#define FMC_BANK_5_6            FMC_Bank5_6
#define FMC_ENABLE()
#define FMC_SDCRx_NC_Pos        (0U)
#define FMC_SDCRx_NR_Pos        (2U)
#define FMC_SDCRx_MWID_Pos      (4U)
#define FMC_SDCRx_NB_Pos        (6U)
#define FMC_SDCRx_CAS_Pos       (7U)
#define FMC_SDCRx_SDCLK_Pos     (10U)
#define FMC_SDCRx_RBURST_Pos    (12U)
#define FMC_SDCRx_RPIPE_Pos     (13U)
#define FMC_SDTRx_TMRD_Pos      (0U)
#define FMC_SDTRx_TXSR_Pos      (4U)
#define FMC_SDTRx_TRAS_Pos      (8U)
#define FMC_SDTRx_TRC_Pos       (12U)
#define FMC_SDTRx_TWR_Pos       (16U)
#define FMC_SDTRx_TRP_Pos       (20U)
#define FMC_SDTRx_TRCD_Pos      (24U)
#elif defined(ARCH_stm32h7)
#define FMC_BANK_5_6            FMC_Bank5_6_R
#define FMC_ENABLE()            SET_BIT(FMC_Bank1_R->BTCR[0], FMC_BCR1_FMCEN)
#endif

/*==============================================================================
  Local object types
==============================================================================*/

/*==============================================================================
  Local function prototypes
==============================================================================*/
static int sdram_init(void);
static int register_heap_regions(void *addr, size_t mem_size, mem_region_t region[],
                                 size_t region_num, size_t region_size);

/*==============================================================================
  Local object
==============================================================================*/
#if __EMI_SDRAM_1_ENABLE__ > 0
static mem_region_t sdram1_heap[__EMI_SDRAM_1_HEAP_REGIONS__ + 1];
#endif

