devdnl/dnx-rtos/src/system/drivers/emi/stm32fx/emi.c
        device_stat->st_size = 0;

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function test RAM memory.
 *
 * @param  address      address
 * @param  size         size (bytes)
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
static int sdram_test(void *address, size_t size)
{
        static const u32_t PATTERN[] = {
                0x08080808,
                0x80008000,
                0xAAAA5555,
                0x5555AAAA,
        };

        int err = 0;

        printk("EMI: memory test @ %p of %u bytes", address, size);

        for (size_t i = 0; i < ARRAY_SIZE(PATTERN); i++) {

                u32_t *ptr = address;
                size_t len = size / sizeof(u32_t);

                while (len) {
                        *ptr++ = PATTERN[i];
                        len--;
                }

                ptr = address;
                len = size / sizeof(u32_t);
                while (len) {
                        if (*ptr != PATTERN[i]) {
                                printk("EMI: error @ %p", ptr);
                                err = EFAULT;
                                break;
                        }
                        ptr++;
                        len--;
                }
        }

        u32_t *ptr = address;
        size_t len = size / sizeof(u32_t);

        while (len) {
                *ptr++ = len;
                len--;
        }

        ptr = address;
        len = size / sizeof(u32_t);
        while (len) {
                if (*ptr != len) {
                        printk("EMI: error @ %p", ptr);
                        err = EFAULT;
                        break;
                }
                ptr++;
                len--;
        }

        printk("EMI: memory test success.");

        return err;
}

//==============================================================================
/**
 * @brief  Wait while the SDRAM is busy.
 */
//==============================================================================
static void sdram_wait_while_busy(void)
{
#if defined(ARCH_stm32f1)
#error No FMC implementation!
#elif defined(ARCH_stm32f4)
        while (FMC_BANK_5_6->SDSR & FMC_SDSR_BUSY);
#elif defined(ARCH_stm32f7)
        sys_sleep_ms(2);
#elif defined(ARCH_stm32h7)
        sys_sleep_ms(2);
#endif
}

//==============================================================================
/**
 * @brief  Calcualte SDRAM refresh rate.
 *
 * @return Calculated refresh rate.
 */
//==============================================================================
static u32_t sdram_calculate_refresh_rate(void)
{
        u32_t fmc_freq = 0;

#if defined(ARCH_stm32f1)
#elif defined(ARCH_stm32f4)
        LL_RCC_ClocksTypeDef freq;
        LL_RCC_GetSystemClocksFreq(&freq);
        fmc_freq = freq.HCLK_Frequency;
#elif defined(ARCH_stm32f7)
        LL_RCC_ClocksTypeDef freq;
        LL_RCC_GetSystemClocksFreq(&freq);
        fmc_freq = freq.HCLK_Frequency;
#elif defined(ARCH_stm32h7)
        fmc_freq = LL_RCC_GetFMCClockFreq(LL_RCC_FMC_CLKSOURCE);
#endif

        i32_t NR = max((2 << (__EMI_SDRAM_1_NR__ + 10)),
                       (2 << (__EMI_SDRAM_2_NR__ + 10)));
        i32_t MHz = fmc_freq / __EMI_SDRAM_SDCLK__ / 1000000;
        i32_t SRR = (((__EMI_SDRAM_REFRESH_RATE_MS__ * 1000) / NR) * MHz) - 20;

        if (SRR < 41) {
                printk("EMI: incorrect SDRAM refresh rate.");
                SRR = 41;
        }

        return SRR;
}

//==============================================================================
/**
 * @brief Function initialize SDRAM controller.
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
static int sdram_init(void)
{
        /*
         * 1. Program the memory device features into the FMC_SDCRx register.
         *    The SDRAM clock frequency, RBURST and RPIPE must be programmed
         *    in the FMC_SDCR1 register.
         */
        FMC_BANK_5_6->SDCR[0] = ((__EMI_SDRAM_RPIPE__  & 3) << FMC_SDCRx_RPIPE_Pos)
                              | ((__EMI_SDRAM_RBURST__ & 1) << FMC_SDCRx_RBURST_Pos)
                              | ((__EMI_SDRAM_SDCLK__  & 3) << FMC_SDCRx_SDCLK_Pos)
                              | ((__EMI_SDRAM_CAS__    & 3) << FMC_SDCRx_CAS_Pos)
                              | ((__EMI_SDRAM_1_NB__   & 1) << FMC_SDCRx_NB_Pos)
                              | ((__EMI_SDRAM_1_MWID__ & 3) << FMC_SDCRx_MWID_Pos)
                              | ((__EMI_SDRAM_1_NR__   & 3) << FMC_SDCRx_NR_Pos)
                              | ((__EMI_SDRAM_1_NC__   & 3) << FMC_SDCRx_NC_Pos);

        FMC_BANK_5_6->SDCR[1] = ((__EMI_SDRAM_RPIPE__  & 3) << FMC_SDCRx_RPIPE_Pos)
                              | ((__EMI_SDRAM_RBURST__ & 1) << FMC_SDCRx_RBURST_Pos)
                              | ((__EMI_SDRAM_SDCLK__  & 3) << FMC_SDCRx_SDCLK_Pos)
                              | ((__EMI_SDRAM_CAS__    & 3) << FMC_SDCRx_CAS_Pos)
                              | ((__EMI_SDRAM_2_NB__   & 1) << FMC_SDCRx_NB_Pos)
                              | ((__EMI_SDRAM_2_MWID__ & 3) << FMC_SDCRx_MWID_Pos)
                              | ((__EMI_SDRAM_2_NR__   & 3) << FMC_SDCRx_NR_Pos)
                              | ((__EMI_SDRAM_2_NC__   & 3) << FMC_SDCRx_NC_Pos);

        /*
         * 2. Program the memory device timing into the FMC_SDTRx register.
         *    The TRP and TRC timings must be programmed in the FMC_SDTR1
         *    register.
         *
         */
        FMC_BANK_5_6->SDTR[0] = (((__EMI_SDRAM_1_TRCD__ - 1) & 0xF) << FMC_SDTRx_TRCD_Pos)
                              | (((__EMI_SDRAM_TRP__    - 1) & 0xF) << FMC_SDTRx_TRP_Pos)
                              | (((__EMI_SDRAM_TWR__    - 1) & 0xF) << FMC_SDTRx_TWR_Pos)
                              | (((__EMI_SDRAM_TRC__    - 1) & 0xF) << FMC_SDTRx_TRC_Pos)
                              | (((__EMI_SDRAM_TRAS__   - 1) & 0xF) << FMC_SDTRx_TRAS_Pos)
                              | (((__EMI_SDRAM_TXSR__   - 1) & 0xF) << FMC_SDTRx_TXSR_Pos)
                              | (((__EMI_SDRAM_TMRD__   - 1) & 0xF) << FMC_SDTRx_TMRD_Pos);

        FMC_BANK_5_6->SDTR[1] = (((__EMI_SDRAM_2_TRCD__ - 1) & 0xF) << FMC_SDTRx_TRCD_Pos)
                              | (((__EMI_SDRAM_TRP__    - 1) & 0xF) << FMC_SDTRx_TRP_Pos)
                              | (((__EMI_SDRAM_TWR__    - 1) & 0xF) << FMC_SDTRx_TWR_Pos)
                              | (((__EMI_SDRAM_TRC__    - 1) & 0xF) << FMC_SDTRx_TRC_Pos)
                              | (((__EMI_SDRAM_TRAS__   - 1) & 0xF) << FMC_SDTRx_TRAS_Pos)
                              | (((__EMI_SDRAM_TXSR__   - 1) & 0xF) << FMC_SDTRx_TXSR_Pos)
                              | (((__EMI_SDRAM_TMRD__   - 1) & 0xF) << FMC_SDTRx_TMRD_Pos);

