devdnl/dnx-rtos/src/system/drivers/emi/stm32fx/emi.c
        FMC_ENABLE();

        /* From this point software is sending commands to SDRAM chips.*/
        /*
         * 3. Set MODE bits to '001' and configure the Target Bank bits
         *    (CTB1 and/or CTB2) in the FMC_SDCMR register to start delivering
         *    the clock to the memory (SDCKE is driven high).
         */
        sdram_wait_while_busy();

        FMC_BANK_5_6->SDCMR = (SDRAM_CMD__CLK_CFG_EN)
                            | (__EMI_SDRAM_1_ENABLE__ * FMC_SDCMR_CTB1)
                            | (__EMI_SDRAM_2_ENABLE__ * FMC_SDCMR_CTB2)
                            | (1 << FMC_SDCMR_NRFS_Pos);

        /*
         * 4. Wait during the prescribed delay period. Typical delay is around
         *    100 μs (refer to the SDRAM datasheet for the required delay after
         *    power-up).
         */
        sys_sleep_ms(1);

        /*
         * 5. Set MODE bits to ‘010’ and configure the Target Bank bits
         *    (CTB1 and/or CTB2) in the FMC_SDCMR register to issue
         *    a “Precharge All” command.
         */
        sdram_wait_while_busy();

        FMC_BANK_5_6->SDCMR = (SDRAM_CMD__PRECHARGE_ALL)
                            | (__EMI_SDRAM_1_ENABLE__ * FMC_SDCMR_CTB1)
                            | (__EMI_SDRAM_2_ENABLE__ * FMC_SDCMR_CTB2)
                            | (1 << FMC_SDCMR_NRFS_Pos);

        /*
         * 6. Set MODE bits to ‘011’, and configure the Target Bank bits
         *    (CTB1 and/or CTB2) as well as the number of consecutive Auto-refresh
         *    commands (NRFS) in the FMC_SDCMR register. Refer to the SDRAM
         *    datasheet for the number of Auto-refresh commands that should be
         *    issued. Typical number is 8.
         */
        sdram_wait_while_busy();

        FMC_BANK_5_6->SDCMR = (SDRAM_CMD__AUTOREFRESH)
                            | (__EMI_SDRAM_1_ENABLE__ * FMC_SDCMR_CTB1)
                            | (__EMI_SDRAM_2_ENABLE__ * FMC_SDCMR_CTB2)
                            | (((__EMI_SDRAM_NRFS__ - 1) & 0xF) << FMC_SDCMR_NRFS_Pos);

        /*
         * 7. Configure the MRD field according to your SDRAM device, set the
         *    MODE bits to '100', and configure the Target Bank bits
         *    (CTB1 and/or CTB2) in the FMC_SDCMR register to issue a
         *    "Load Mode Register" command in order to program the SDRAM. In
         *    particular:
         *    a) The CAS latency must be selected following configured value in
         *       FMC_SDCR1/2 registers
         *    b) The Burst Length (BL) of 1 must be selected by configuring the
         *       M[2:0] bits to 000 in the mode register (refer to the SDRAM
         *       datasheet). If the Mode Register is not the same for both SDRAM
         *       banks, this step has to be repeated twice, once for each bank,
         *       and the Target Bank bits set accordingly.
         */
        sdram_wait_while_busy();

        u32_t MRD = SDRAM_MODE_REG_WRITE_BURST_MODE_SINGLE_LOCATION_ACCESS
                  | SDRAM_MODE_REG_OPERATING_MODE_STANDARD
                  | (__EMI_SDRAM_CAS__ << SDRAM_MODE_REG_CAS_LATENCY_Pos)
                  | SDRAM_MODE_REG_BURST_TYPE_SEQUENTIAL
                  | SDRAM_MODE_REG_BURST_LENGTH_1;

        FMC_BANK_5_6->SDCMR = (SDRAM_CMD__LOADMODEREG)
                            | (__EMI_SDRAM_1_ENABLE__ * FMC_SDCMR_CTB1)
                            | (__EMI_SDRAM_2_ENABLE__ * FMC_SDCMR_CTB2)
                            | (1 << FMC_SDCMR_NRFS_Pos)
                            | (MRD << FMC_SDCMR_MRD_Pos);

        /*
         * 8. Program the refresh rate in the FMC_SDRTR register. The refresh
         *    rate corresponds to the delay between refresh cycles. Its value
         *    must be adapted to SDRAM devices.
         */
        sdram_wait_while_busy();

        u32_t SRR = sdram_calculate_refresh_rate();
        FMC_BANK_5_6->SDRTR |= (SRR << FMC_SDRTR_COUNT_Pos);

        sdram_wait_while_busy();


        /*
         * Register memory regions in system.
         */
        int err1 = ESUCC;
        int err2 = ESUCC;

#if __EMI_SDRAM_1_ENABLE__ > 0
        u32_t mem_addr1 = 0xC0000000;

        size_t mem_size1 = (2 << (__EMI_SDRAM_1_NR__ + 10))      // Row bits (0 - 11 bits: A10)
                         * (2 << (__EMI_SDRAM_1_NC__ +  7))      // Col bits (0 - 8 bits:  A7)
                         * (2 << (__EMI_SDRAM_1_NB__     ))      // Banks (2 or 4)
                         * (8 << (__EMI_SDRAM_1_MWID__   ))      // Bus width
                         / (8);                                  // Bits per byte

        err1 = sdram_test((void*)mem_addr1, mem_size1);
        if (!err1) {
                err1 = register_heap_regions((void*)mem_addr1, mem_size1,
                                             sdram1_heap, ARRAY_SIZE(sdram1_heap),
                                             (__EMI_SDRAM_1_HEAP_REGION_SIZE__ * 1024) & 0xFFFFFFFC);
        }
#endif

#if __EMI_SDRAM_2_ENABLE__ > 0
        u32_t mem_addr2 = 0xD0000000;

        size_t mem_size2 = (2 << (__EMI_SDRAM_2_NR__ + 10))      // Row bits (0 - 11 bits: A10)
                         * (2 << (__EMI_SDRAM_2_NC__ +  7))      // Col bits (0 - 8 bits:  A7)
                         * (2 << (__EMI_SDRAM_2_NB__     ))      // Banks (2 or 4)
                         * (8 << (__EMI_SDRAM_2_MWID__   ))      // Bus width
                         / (8);                                  // Bits per byte

        err2 = sdram_test((void*)mem_addr2, mem_size2);
        if (!err2) {
                err2 = register_heap_regions((void*)mem_addr2, mem_size2,
                                             sdram2_heap, ARRAY_SIZE(sdram2_heap),
                                             (__EMI_SDRAM_2_HEAP_REGION_SIZE__ * 1024) & 0xFFFFFFFC);
        }
#endif

        return err1 ? err1 : (err2 ? err2 : ESUCC);
}

//==============================================================================
/**
 * @brief  Function register selected number of memory regions in SDRAM.
 *
 * @param  add          memory start address
 * @param  mem_size     memory size
 * @param  region       region array
 * @param  region_num   number of regions in array
 * @param  region_size  size of single region
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
static int register_heap_regions(void *addr, size_t mem_size, mem_region_t region[],
                                 size_t region_num, size_t region_size)
{
        int err = EINVAL;

        for (size_t i = 0; (i < (region_num - 1)) && (mem_size > 0); i++) {
                size_t heap_sz = min(mem_size, region_size);
                err = sys_register_region(&region[i], addr, heap_sz,
                                          _MM_FLAG__DMA_CAPABLE, "SDRAM");
                addr     += heap_sz;
                mem_size -= heap_sz;
        }

        if (mem_size > 0) {
                err = sys_register_region(&region[region_num - 1], addr, mem_size,
                                          _MM_FLAG__DMA_CAPABLE, "SDRAM");
        }

        return err;
}

/*==============================================================================
  End of file
==============================================================================*/
